# count = 0
# number = int(input('Введите целое число: '))
# if type(number) == int():
#     count = number
#     print(count)

# def get_string_length():
#     print(get_string_length('Hello')
    



    

# Дан словарь, в котором ключом является имя студента, а значением словарь с его оценками по 3 предметам. Замените оценки названием предмета, по которому студент имеет высший балл. Например: a = {'John': {'history': 90, 'math': 95, 'literature': 91}, 'Rose': {'history': 92, 'math': 96, 'literature': 81}, 
# 'Kelly': {'history': 84, 'math': 85, 'literature': 87}} 
# Результат: {'John': 'math', 'Rose': 'math', 'Kelly': 'literature'}



# dict_ = {['history']: [84], ['math']: [85], ['literature']: [87]}}
# if dict_[1]>dict_[4]>dict_[6]:
#     dict_.remove(max[1,4,6])
# elif dict_[4]>dict_[1]>>dict_[6]:
#     dict_.remove([max[1,4,6]])
# elif dict_[6]>dict_[1]>dict_[4]:
#     dict_.remove(max[1,4,6]):



    